
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СКД = ТекущийОбъект.СхемаКомпоновкиДанных.Получить();
	
	Если СКД = Неопределено Тогда	
		СКД = КликХаусСервер.ИнициализироватьСКД(ТекущийОбъект.Ссылка);	
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	
КонецПроцедуры



&НаКлиенте
Процедура КонсольЗапроса(Команда)
	
	ПараметрыНовойФормы = Новый Структура("ТекстЗапроса", Объект.ТекстЗапроса);
	
	ОткрытьФорму("Справочник.CH_Отчеты.Форма.КонсольЗапроса", ПараметрыНовойФормы, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	
	Позиция = СтрНайти(Объект.ТекстЗапроса, "&",, 1);
	
	Пока Не Позиция = 0 Цикл
		
	//TODO:  сделать парсинг параметров запроса		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторСхемыКомпоновкиДанных(Команда)
	
	Если Модифицированность 
		Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед модицикацией СКД, запишите отчет.");
		
		Возврат;
		
	КонецЕсли;
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Если Не ЗначениеЗаполнено(СхемаКомпоновкиДанных) Тогда
			СКД = КликХаусСервер.ИнициализироватьСКД(Объект.Ссылка);
			СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);	
		КонецЕсли;
		
		СКД = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
		
		КликХаусСервер.АктуализироватьСКД(СКД, Объект.Ссылка);
		
		КонструкторСКД = Новый КонструкторСхемыКомпоновкиДанных(СКД);
		КонструкторСКД.Редактировать(ЭтаФорма);
		
	#Иначе
		Сообщить("Модификация СКД может производиться только в толстом клиенте (упр).");
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Модифицированность = Истина;
	ПоместитьВоВременноеХранилище(ВыбранноеЗначение, СхемаКомпоновкиДанных);
	
КонецПроцедуры





