
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Результат = ВыполнитьПроверкуНаСервере();
	
	ПоказатьПредупреждение(, Формат(Результат, "БЛ='Ошибка соединения'; БИ='Все работает'"),, "Проверка соединения");
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуНаСервере()
	
	АдресСервера = "";
	ПортСервера = 0;
	
	Если Не КликХаусСервер.НастройкиСоединенияКорректны(АдресСервера, ПортСервера) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(АдресСервера, ПортСервера);
	
	Запрос = Новый HTTPЗапрос("");
	
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Истина;
	Иначе
		Сообщить(Ответ.ПолучитьТелоКакСтроку());
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
