
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ТекстЗапроса", ТекстЗапроса) Тогда
		Элементы.ФормаПеренестиВОтчет.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОтчет(Команда)
	
	ВладелецФормы.Объект.ТекстЗапроса = ТекстЗапроса;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция НачатьВыполнениеЗапроса(ТекстЗапроса, ИнформацияОВыполнении = Неопределено)
	
	ОбщееВремяНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатВыполнения = КликХаусСервер.ВыполнитьЗапросНаСервере(ТекстЗапроса, ИнформацияОВыполнении);
	
	ТекущаяДатаПреобразованиеJSONНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Результат = КликХаусСервер.ПреобразоватьИнформациюОВыполненииВТабличныйДокумент(ИнформацияОВыполнении, РезультатВыполнения);
	ТекущаяДатаПреобразованиеJSONКонец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Не ИнформацияОВыполнении = Неопределено Тогда
		ИнформацияОВыполнении.Вставить("ОбщееВремя", (ТекущаяДатаПреобразованиеJSONКонец - ОбщееВремяНачало) / 1000);
		ИнформацияОВыполнении.Вставить("ВремяПреобразования", (ТекущаяДатаПреобразованиеJSONКонец - ТекущаяДатаПреобразованиеJSONНачало) / 1000);
	КонецЕсли;
	
	Возврат ЗаполнитьИнформацию(ИнформацияОВыполнении)
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьИнформацию(ИнформацияОВыполнении)
	
	Если ИнформацияОВыполнении = Неопределено Тогда
		ПрочитаноБайт = 0;
		ПрочитаноВремя = 0;
		ПрочитаноСтрок = 0;
		КоличествоСтрок = 0;   
		ВремяВыполненияHTTP = 0;
		ВремяПреобразованияJSON = 0;
		ВремяЧтенияJSON = 0;
		ОбщееВремяВыполнения = 0;
		
		Возврат Ложь;
		
	Иначе
		ПрочитаноБайт = ИнформацияОВыполнении.statistics.bytes_read;
		ПрочитаноВремя = ИнформацияОВыполнении.statistics.elapsed;
		ПрочитаноСтрок = ИнформацияОВыполнении.statistics.rows_read;
		КоличествоСтрок = ИнформацияОВыполнении.rows;
		ВремяВыполненияHTTP = ИнформацияОВыполнении.ВремяВыполненияHTTPЗапроса;
		ВремяПреобразованияJSON = ИнформацияОВыполнении.ВремяПреобразования;
		ВремяЧтенияJSON =  ИнформацияОВыполнении.ВремяЧтенияJSON;
		ОбщееВремяВыполнения = ИнформацияОВыполнении.ОбщееВремя;
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокБаз(Команда)
	
	ИнформацияОВыполнении = Неопределено;
	Элементы.ИмяБазы.СписокВыбора.Очистить();
	
	Если Не НачатьВыполнениеЗапроса("show databases", ИнформацияОВыполнении) Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого СтрокаДанных Из ИнформацияОВыполнении.data Цикл
		Элементы.ИмяБазы.СписокВыбора.Добавить(СтрокаДанных.name);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокТаблиц(Команда)
	
	ИнформацияОВыполнении = Неопределено;
	Элементы.ИмяТаблицы.СписокВыбора.Очистить();
	
	Если Не ПустаяСтрока(ИмяБазы) Тогда
		ТекстЗапросаСервер = "show tables from " + ИмяБазы;
	Иначе
		ТекстЗапросаСервер = "show tables";
	КонецЕсли;
	
	Если Не НачатьВыполнениеЗапроса(ТекстЗапросаСервер, ИнформацияОВыполнении) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ИнформацияОВыполнении.data Цикл
		Элементы.ИмяТаблицы.СписокВыбора.Добавить(СтрокаДанных.name);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОписаниеТаблицы(Команда)
	
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Сообщить("Заполните наименование таблицы");
		Возврат;
	КонецЕсли;
		
	
	Если ЗначениеЗаполнено(ИмяБазы) Тогда
		ТекстЗапросаСервер = "desc " + ИмяБазы + "." + ИмяТаблицы;
	Иначе
		ТекстЗапросаСервер = "desc " + ИмяБазы;
	КонецЕсли;
	
	НачатьВыполнениеЗапроса(ТекстЗапросаСервер)
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	НачатьВыполнениеЗапроса(ТекстЗапроса);
КонецПроцедуры
