
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОтчетСсылка", ОтчетСсылка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Заголовок = "Отчет CH: " + ОтчетСсылка;
	
	СхемаКомпоновкиДанных = ОтчетСсылка.СхемаКомпоновкиДанных.Получить();
	
	АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	Элементы.ГруппаНастройкаОтчета.Видимость = Не Элементы.ГруппаНастройкаОтчета.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	
	//ПодключитьОбработчикОжидания("ПроверитьФормированиеОтчета", 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормированиеОтчета() Экспорт 
	
	Данные = ПолучитьИзВременногоХранилища(АдресРезультат);
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ПроверитьФормированиеОтчета");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Элементы.КольцоПрогресса.Видимость = Истина;
	Элементы.Результат.Видимость = Ложь;
	
	АдресРезультат = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	АдресПараметры = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки()), УникальныйИдентификатор);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ОтчетСсылка);
	МассивПараметров.Добавить(АдресРезультат);
	МассивПараметров.Добавить(АдресПараметры);
	
	Наименование = "Формирование отчета: " + ОтчетСсылка;
	
	ФоновыеЗадания.Выполнить("КликХаусСервер.НачатьФормированиеОтчета", МассивПараметров, ОтчетСсылка.УникальныйИдентификатор(), Наименование);
	
КонецПроцедуры


