
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не Параметры.Свойство("ОтчетСсылка", Отчет.ОтчетСсылка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.ОтчетСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = Отчет.ОтчетСсылка.СхемаКомпоновкиДанных.Получить();
	
	Адрес = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	ЭтаФорма.Заголовок = "Отчет: " + Отчет.ОтчетСсылка;
		
		
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Адрес);
	Отчет.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);	
		
		
КонецПроцедуры


&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииВариантаНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры

